---
title: 思科交换机与路由器配置笔记
categories: 网络
tags: 笔记 思科 交换机 路由器
---

* content
{:toc}
## 模拟器信息

模拟器名称：Cisco Packet Tracer Student

常用设备：

* 交换机 2960
* 路由器 2911
* 三层交换机 3560



软件设置:

option->preferences(Ctrl+R)->  
[ ] Show Device Model Labels  
[ ] Show Device Name Labels  
[*] Always Show Port Labels 



## 交换机基本模式

用户模式

```
Switch>
```

特权模式

```
Switch>enable
Switch>en
Switch#
```

全局配置模式

```
Switch#configure terminal
Switch#conf t
Switch(config)#
```

接口模式

```
Switch(config)#interface fastEthernet 0/1
Switch(config)#in f 0/1
Switch(config-if)#
```

返回

* `exit` 返回上一模式
* `end` 从接口或者特全局配置模式回到特权模式，与快捷键 `Ctrl+z` 效果相同
* `ctrl+shift+6` 从命令输入错误中退出



## 交换机基本配置

查看配置

```
Switch#show running-config
Switch#show run
```

更改主机名

```
Switch(config)#hostname new_name
```

设置密码

```
Switch(config)#enable password 1
```

保存交换机配置

```
Switch#copy running-config startup-config
Switch#write
```

恢复出厂设置

```
Switch#erase startup-config
```

重启

```
Switch#reload
```

禁用DNS查询

```
Switch(config)#no ip domain-lookup
```

防止动态信息打断命令输入

```
Switch(config)#line console 0
Switch(config-line)#logging synchronous
```

设置命令行永不超时锁定

```
Switch(config)#line console 0
Switch(config-line)#exec-timeout 0 0
```

 

## 交换机Vlan配置

### 创建Vlan

```
Switch(config)#vlan vlan-id
Switch(config)#no vlan vlan-id  #删除VLAN
```

### 将端口加入到相应的Vlan

```
Switch(config)#in f 0/1
Switch(config-if)#switchport access vlan vlan-id  #
Switch(config-if)#no switchport access vlan vlan-id  #删除
```

### 查看Vlan信息

```
Switch#show vlan  #
Switch#show vlan brief  #
Switch#show vlan id vlan-id  #
```

### 在Vlan上配置IP

```
Switch(config)#interface vlan vlan-id #
Switch(config-if)#ip address 192.168.1.1 255.255.255.0 #
```

### 在VLAN上配置默认网关

```
Switch(config)#ip default-gateway 192.168.0.254
```

### 查看接口信息

```
Switch#show interfaces fastEthernet 0/1 switchport
```

### 案例1

![案例1：vlan配置](/images/network/network_demo_1.png)

1、规划IP地址

2、添加VLAN

3、添加端口到VLAN



## 中继链路

### 改接口为trunk模式

```
Switch(config-if)#switchport mode trunk
```

三层交换机配置trunk接口需要指定加密类型

```
Switch(config-if)#switchport trunk encapsulation dot1q 
```



### 在trunk模式下禁止vlan通过

```
Switch(config-if)#switchport trunk allowed vlan remove 3
Switch(config-if)#switchport trunk allowed vlan add 3
```



## 以太通道

### 捆绑为以太通道

```
Switch(config-if-range)#channel-group 1 mode on
```

### 进入以太通道

```
Switch(config)#interface port-channel 1
```

### 查看通道信息

```
Switch#show etherchannel summary
```



### 案例2

![案例2：以太通道配置](/images/network/network_demo_2.png)

1. 创建vlan 5              vlan      5
2. 创建vlan 10             vlan 10
3. 进入接口f0/1            in f 0/1
4. 将接口加入vlan 5        sw ac vl 5
5. 进入接口f0/2            in f 0/2
6. 将接口加入vlan 10       sw ac vl 10
7. 进入接口f0/3和4         in r f0/3-4
8. 捆绑为1号通道           channel-group 1 mode on
9. 将接口改为trunk模式     sw mo t



## 路由器配置

### 配置IP

```
Router(config)#interface gigabitEthernet 0/1  #进入接口
Router(config-if)#ip address 192.168.1.254 255.255.255.0  #配置IP
Router(config-if)#no shutdown  #开启端口
```

### 查看路由表

```
Router#show ip route
```

### 静态路由

格式：`ip route 目标网段 子网掩码 下一跳IP`

```
Router(config)#ip route 192.168.2.0 255.255.255.0 192.168.1.2
```

### 默认路由

格式：`ip route 0.0.0.0 0.0.0.0 下一跳IP`

```
Router(config)#ip route 0.0.0.0 0.0.0.0 192.168.1.2  
```

### 动态路由

启动 OSPF 路由进程

格式：`router ospf id`

```
Router(config)#router ospf 1 
```

指定 OSPF 协议运行的接口和所在区域

格式：`network address inverse-mask area id`

```
Router(config-router)#network 192.168.4.0 0.0.0.255 area 0 
```

### 案例3

![案例3：路由配置](/images/network/network_demo_3.png)



## 三层交换机

### 开启三层交换机路由功能

```
Switch(config)#ip routing
```

### 将三层交换机端口转换为路由器端口

```
Switch(config-if)#no switchport
```

### 案例4

![案例4：三层交换机-路由配置](/images/network/network_demo_4.png)

1. 配置客户机地址（IP地址， 子网掩码， 网关）
2. 交换机 创建vlan 2，vlan 3
3. 交换机 将接口加入vlan
4. 交换机 配置trunk接口
5. 三层交换机 开启路由功能
6. 三层交换机 创建vlan 2，vlan 3
7. 三层交换机 配置vlan的IP地址
8. 三层交换机 将接口加入vlan
9. 三层交换机 配置trunk接口



## 访问控制列表

### 创建ACL

格式：`access-list number { permit | deny } source` 

```
Router(config)#access-list 1 permit host 192.168.2.2 #允许192.168.2.2
Router(config)#access-list 1 deny 192.168.2.2 0.0.0.0 #拒绝192.168.2.2
Router(config)#access-list 1 permit any #允许所有
```

### 将ACL应用于接口

格式：`ip access-group number { in | out }`

```
Router(config-if)#ip access-group 1 in  #
Router(config-if)#no ip access-group 1 out #删除
```

### 查看访问控制列表

```
show access-lists 
```

### 删除ACL

```
Router(config)#no access-list number
```

### 案例5

- 禁止主机PC 2访问主机PC 1，而允许其它所有流量
- 允许主机PC 2访问主机PC 1，而禁止其它所有流量

![案例5：ACL访问控制](/images/network/network_demo_5.png)



## NAT技术

### 静态转换

1、建立静态地址转换

格式：`ip nat inside source static 内网IP 公网IP`

```
Router(config)#ip nat inside source static 192.168.1.1 100.0.0.2
```

2、在内部和外部端口上启用NAT

```
Router(config)#in g 0/0  
Router(config-if)#ip nat inside  
Router(config-if)#in g0/1  
Router(config-if)#ip nat outside 
```

### 端口多路复用

1、定义内部IP

```
Router(config)#access-list 1 permit 192.168.1.0 0.0.0.255
```

2、建立动态地址转换

```
Router(config)#ip nat inside source list 1 interface g 0/1 overload
```

3、在内部和外部端口上启用NAT

```
Router(config)#in g 0/0  
Router(config-if)#ip nat inside  
Router(config-if)#in g0/1  
Router(config-if)#ip nat outside 
```

### NAT排错

```
Router#debug ip nat     #启用
Router#undebug ip nat   #关闭
```

### 案例6

![案例6：NAT](/images/network/network_demo_6.png)



## STP生成树协议

### 启用生成树命令

```
Switch(config)#spanning-tree vlan vlan-id  #默认已启用
```

### 指定根网桥

```
Switch(config)#spanning-tree vlan vlan-id priority num-priority  #num-priority 取值范围 0～65535，4096的倍数
Switch(config)#spanning-tree vlan vlan-id root { primary | secondary }  #
```

### 查看生成树配置

```
Switch#show spanning-tree
```

### 查看某个VLAN的生成树详细信息

```
Switch#show spanning-tree vlan vlan-id
```

### 案例7

![案例7：生成树](/images/network/network_demo_7.png)

1. 所有交换机配置vlan 2
2. 所有交换机所有接口配置trunk链路
3. 三层交换机 1 设置vlan1为主，vlan2为次
4. 三层交换机 2 设置vlan2为主，vlan1为次





## 案例

![案例8：生成树](/images/network/network_demo_8.png)


* 交换机
  1. 配置 vlan
  2. 配置 trunk
* 三层交换机
  1. 配置 vlan
  2. 配置 trunk
  3. 配置 vlan IP
  4. 配置接口IP
  5. 配置动态路由
* 路由器
  1. 配置接口IP
  2. 配置动态路由
  3. 配置NAT



```
sw1
# 配置 vlan
Switch(config)#vlan 10
Switch(config-vlan)#in r f 0/1-2
Switch(config-if-range)#sw ac vl 10

sw2
# 配置 vlan
Switch(config)#vlan 11
Switch(config-vlan)#vlan 12
Switch(config-vlan)#in f 0/1
Switch(config-if)#sw ac vl 11
Switch(config-if)#in f 0/3
Switch(config-if)#sw ac vl 12
# 配置 trunk
Switch(config-if)#in f 0/2
Switch(config-if)#sw mode trunk

三层交换机
# 配置 vlan
Switch(config)#vlan 10
Switch(config-vlan)#vlan 11
Switch(config-vlan)#vlan 12
Switch(config-vlan)#in f 0/1
Switch(config-if)#sw ac vl 10
# 配置 trunk
Switch(config-if)#in f 0/2
Switch(config-if)#sw trunk encapsulation dot1q 
Switch(config-if)#sw mode trunk
# 配置 vlan IP
Switch(config-if)#in vl 10
Switch(config-if)#ip ad 192.168.10.254 255.255.255.0
Switch(config-if)#in vl 11
Switch(config-if)#ip ad 192.168.11.254 255.255.255.0
Switch(config-if)#in vl 12
Switch(config-if)#ip ad 192.168.12.254 255.255.255.0
# 配置接口IP
Switch(config-if)#in f 0/3
Switch(config-if)#no sw
Switch(config-if)#ip ad 192.168.20.2 255.255.255.0
# 配置动态路由
Switch(config)#ip routing
Switch(config)#router ospf 1
Switch(config-router)#network 192.168.10.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.11.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.12.0 0.0.0.255 area 0
Switch(config-router)#network 192.168.20.0 0.0.0.255 area 0

路由器
# 配置接口IP
Router(config)#in g 0/0
Router(config-if)#no shu
Router(config-if)#ip ad 192.168.20.1 255.255.255.0
Router(config)#in g 0/0
Router(config-if)#no shu
Router(config-if)#ip ad 200.0.0.1 255.255.255.0
# 配置动态路由
Router(config)#route ospf 1
Router(config-router)#network 192.168.20.0 0.0.0.255 area 0
Router(config-router)#network 200.0.0.0 0.0.0.255 a 0
# 配置NAT
Router(config)#access-list 1 permit any
Router(config)#ip nat inside source list 1 in g 0/1 overload 
Router(config)#in g 0/1
Router(config-if)#ip nat outside
Router(config-if)#in g 0/0
Router(config-if)#ip nat inside 
```



